Revit 2016 API
CurveElement.SetSketchPlaneAndCurve Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public void SetSketchPlaneAndCurve(
	SketchPlane sketchPlane,
	Curve curve
)
Visual Basic
Public Sub SetSketchPlaneAndCurve ( _
	sketchPlane As SketchPlane, _
	curve As Curve _
)
Visual C++
public:
void SetSketchPlaneAndCurve(
	SketchPlane^ sketchPlane,
	Curve^ curve
)
Parameters
sketchPlane
Type: Autodesk.Revit.DB.SketchPlane
curve
Type: Autodesk.Revit.DB.Curve
See Also
CurveElement Class
Autodesk.Revit.DB Namespace